# <center><u>Pandas <u> </center>

## 1.[Pandas Series](https://pandas.pydata.org/pandas-docs/stable/reference/series.html)

resource - https://www.youtube.com/watch?v=m7gxnZx2vT4

<p style='text-align: right;'> 1*4=4 points</p>

Import pandas and numpy with their aliases

In [1]:
import numpy as np
import pandas as pd

Create a variable a = pd.Series([ 100, 200, 300, 400])

In [2]:
a=pd.Series([100,200,300,400])

Print a, and data type

In [3]:
print(a)
print(type(a))

0    100
1    200
2    300
3    400
dtype: int64
<class 'pandas.core.series.Series'>

Using indexing access the element 300 from the series a.

In [4]:
a[2]

300

What are the values of index for series a?

<p style='text-align: right;'> 2*4 = 8 points</p>

In [5]:
a.index

RangeIndex(start=0, stop=4, step=1)

Change the index to  ['c', 'a', 'b', 'd']

In [6]:
a.index=['c','a','b','d']
print(a)

c    100
a    200
b    300
d    400
dtype: int64

Access the value in the series with index 'd'

In [7]:
a['d']

400

Sort the values wrt to the index and print it

In [8]:
a=a.sort_index()
a

a    200
b    300
c    100
d    400
dtype: int64

Create a new Pandas Series b having index as 'e', 'f', and 'g' and value 800,450,100 and print it

<p style='text-align: right;'> 4*2=8 points</p>

In [9]:
b= pd.Series([800,450,100],index=['e','f','g']) 
b # code here

e    800
f    450
g    100
dtype: int64

Append b series at the end of a series

In [10]:
a=a.append(b)

In [11]:
#print a again after appending b into it
print(a)

a    200
b    300
c    100
d    400
e    800
f    450
g    100
dtype: int64

Sort the values in descending order of a and print the index of the sorted series

In [12]:
a = a.sort_values(ascending=False)#code here

In [13]:
# print index of a
a.index

Index(['e', 'f', 'd', 'b', 'a', 'g', 'c'], dtype='object')

## 2. [Pandas DataFrame](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.html)

Reference:-https://www.youtube.com/watch?v=KB-19V-cSs4

<p style='text-align: right;'> 8*2 = 16 points</p>

### Part 1

<p style='text-align: right;'> 5 points</p>

Create a pandas dataframe df from the series 'a' that we used in the last section, print the dataframe

In [14]:
df=pd.DataFrame(a)
print(df)

     0
e  800
f  450
d  400
b  300
a  200
g  100
c  100

Point to ponder! Don't you think series a and dataframe df looks alike? But there must be some difference between them. 
Hey buddy think and write your thoughts below.

In [15]:
# happy to know your comment

#Answer
# Series    ---> consist of single list
# DataFrame ---> collection of series

<p style='text-align: right;'> 2 + 1*4 = 6 points</p>

What is the shape of the datafarme <br>

In [16]:
df.shape

(7, 1)

Hey! remember shape (7,1) implies dataframe has 7 rows and 1 column.

What is the index of the dataframe, is it same as the series 'a' ?

In [17]:
df.index

Index(['e', 'f', 'd', 'b', 'a', 'g', 'c'], dtype='object')

print the head and tail of the dataframe. <br>
Additional - (what does head and tali represent?)

In [18]:
#head
df.head()   #Prints top 5 records of the dataset

     0
e  800
f  450
d  400
b  300
a  200

In [19]:
#tail
df.tail() #Prints last 5 records of the dataset

     0
d  400
b  300
a  200
g  100
c  100

Rename the columns of the dataframe as 'points'

<p style='text-align: right;'> 2 points</p>

In [20]:
df.columns=['points']
print(df)

   points
e     800
f     450
d     400
b     300
a     200
g     100
c     100

Create another Series 'fruits', which contains random names of fruits from ['orange','mango','apple']. The series should contain 7 elements, randomly selected from ['orange','mango','apple']

<p style='text-align: right;'> 5 points</p>

In [21]:
#Create fruits array
fruits = np.random.choice(['orange','mango','apple'],7)
fruits

array(['mango', 'apple', 'orange', 'apple', 'apple', 'orange', 'mango'],
      dtype='<U6')

The above output might vary based randomness

In [22]:
#Create series fruits out of fruits array
fruits=pd.Series(fruits)
fruits

0     mango
1     apple
2    orange
3     apple
4     apple
5    orange
6     mango
dtype: object

Change the index of fruits to the index of dataframe df

<p style='text-align: right;'> 5 points</p>

In [23]:
fruits.index=df.index
print(fruits)

e     mango
f     apple
d    orange
b     apple
a     apple
g    orange
c     mango
dtype: object

Add this fruits series as a new column to the dataframe df with its column name as 'fruits' <br> print the head of the dataframe to verify

In [24]:
df['fruits']=fruits
df.head()

   points  fruits
e     800   mango
f     450   apple
d     400  orange
b     300   apple
a     200   apple

<u>Bonus optional question:</u> <br>
What if we had to changed the index of the dataframe? <br>
Try to add any series to the dataframe with the origianl index (when index of series is not same as to the index of dataframe)

Use series as pd.Series([100,200,300,400,500,600,700]) and try to add it to df with column name Bonus_number.

Bonus marks: 5 points

In [25]:
#bonus code here

#As the indexes are not same, it will show NaN values(or null values) instead of actual series values 
df['Bonus_number']=pd.Series([100,200,300,400,500,600,700])
df

   points  fruits  Bonus_number
e     800   mango           NaN
f     450   apple           NaN
d     400  orange           NaN
b     300   apple           NaN
a     200   apple           NaN
g     100  orange           NaN
c     100   mango           NaN

### Part 2
Reference:- https://www.youtube.com/watch?v=yPVQZZmheCg

Create a dataframe  d1 where the columns are  ‘city’ : [‘Chandigarh’, ‘Delhi’, ‘Kanpur’, ‘Chennai’, ‘Manali’ ] and ‘Temperature’ : [15, 22, 20, 26,-2]

<p style='text-align: right;'> 2*5=10 points</p>

In [26]:
data = {'city': ['Chandigarh', 'Delhi', 'Kanpur', 'Chennai', 'Manali'],
        'Temperature': [15,22,20,26,-2]}
d1 = pd.DataFrame(data)

Print d1

In [27]:
print(d1)

         city  Temperature
0  Chandigarh           15
1       Delhi           22
2      Kanpur           20
3     Chennai           26
4      Manali           -2

What is the shape of d1.

In [28]:
d1.shape

(5, 2)

Set city = d1['city']

In [29]:
city = d1['city']

print city <br>
What is the type of city.

In [30]:
print(city)
print(type(city))

0    Chandigarh
1         Delhi
2        Kanpur
3       Chennai
4        Manali
Name: city, dtype: object
<class 'pandas.core.series.Series'>

Create another dataframe d2 where the columns are <br>
'city' - ['Bengalaru','Coimbatore','Srirangam','Pondicherry'] <br>
'Temperature' - [24,35,36,39]

<p style='text-align: right;'> 3+2+5 = 10 points</p>

In [31]:
d2=pd.DataFrame({'city': ['Bengalaru','Coimbatore','Srirangam','Pondicherry'],'Temperature':[24,35,36,39]})
print(d2)

          city  Temperature
0    Bengalaru           24
1   Coimbatore           35
2    Srirangam           36
3  Pondicherry           39

print the shape of this dataframe

In [32]:
print(d2.shape)

(4, 2)

merge the two dataframes together, save it in a new dataframe named 'd3'

In [33]:
d3 = pd.concat([d1,d2])
d3

          city  Temperature
0   Chandigarh           15
1        Delhi           22
2       Kanpur           20
3      Chennai           26
4       Manali           -2
0    Bengalaru           24
1   Coimbatore           35
2    Srirangam           36
3  Pondicherry           39

# fun fact at high level

1. .concat() simply stacks multiple DataFrame together either vertically, or stitches horizontally after aligning on index
2. .merge() first aligns two DataFrame' selected common column(s) or index, and then pick up the remaining columns from the aligned rows of each DataFrame

Do you know about join function? This interesting quest we give to you to find.

Select the part of the dataframe such that it contains cities where temp is less then or equal to 20 <br>
How many cities are there?

<p style='text-align: right;'> 5+5=10 points</p>

In [34]:
d3.iloc[np.where(d3['Temperature']<=20)]

         city  Temperature
0  Chandigarh           15
2      Kanpur           20
4      Manali           -2

Select the part of the dataframe such that it contains the cities where tempearature greater than or equal to 35

In [35]:
d3.iloc[np.where(d3['Temperature']>=35)]

          city  Temperature
1   Coimbatore           35
2    Srirangam           36
3  Pondicherry           39

## 3. Applying functions to columns and creating new columns

Reference: https://www.youtube.com/watch?v=L0wMml__Gow

<p style='text-align: right;'> 20 points</p>

We need to create another column in d3, which contains  a boolean value for each city to indicate whether it's a union territory or not. 
- HINT: Chandigarh, Pondicherry and Delhi are only 3 union territories here.

In [36]:
union_territory=['Chandigarh','Pondicherry','Delhi']
d3['is_ut']=d3['city'].isin(union_territory)

In [37]:
#print d3
d3

          city  Temperature  is_ut
0   Chandigarh           15   True
1        Delhi           22   True
2       Kanpur           20  False
3      Chennai           26  False
4       Manali           -2  False
0    Bengalaru           24  False
1   Coimbatore           35  False
2    Srirangam           36  False
3  Pondicherry           39   True

The temperatures mentioned in ‘Temperature’ column are mentioned in Celsius, we need another column which contains the same in Fahrenheit.

HINT - 
- Define a function c_to_f which takes input temp in celsius and returns a value with temperature in Fahrenheit.
- To check: c_to_f(10) should return 50.

In [38]:
# write function here
def c_to_f(temp):
    return ((9/5)*temp)+32

In [39]:
# check  function c_to_f(10)
c_to_f(10)

50.0

In [40]:
# apply function c_to_f to d3 to create a column 'temp_farenhiet'
d3['temp_farenhiet'] = d3['Temperature'].apply(c_to_f)
d3

          city  Temperature  is_ut  temp_farenhiet
0   Chandigarh           15   True            59.0
1        Delhi           22   True            71.6
2       Kanpur           20  False            68.0
3      Chennai           26  False            78.8
4       Manali           -2  False            28.4
0    Bengalaru           24  False            75.2
1   Coimbatore           35  False            95.0
2    Srirangam           36  False            96.8
3  Pondicherry           39   True           102.2

## 4. Indexing and selecting rows in DataFrame

Reference:-https://www.youtube.com/watch?v=XKFRFDgA7ZY

<p style='text-align: right;'> 20 points</p>

Select subset of the dataframe d3 such that it contains the cities which are union territories.

In [41]:
d3.iloc[np.where(d3['is_ut']==True)]

          city  Temperature  is_ut  temp_farenhiet
0   Chandigarh           15   True            59.0
1        Delhi           22   True            71.6
3  Pondicherry           39   True           102.2

Select a subset of the dataframe d1 such that it contains the cities which only have temperature above 90 Farenhiet.

In [42]:
d3.iloc[np.where(d3['temp_farenhiet']>90.0)]

          city  Temperature  is_ut  temp_farenhiet
1   Coimbatore           35  False            95.0
2    Srirangam           36  False            96.8
3  Pondicherry           39   True           102.2

Select only the first three rows of the dataframe d1.

In [43]:
d1[:3]

         city  Temperature
0  Chandigarh           15
1       Delhi           22
2      Kanpur           20

Select all the rows and last two columns in the dataframe.

In [44]:
d3.iloc[:,-2:]

   is_ut  temp_farenhiet
0   True            59.0
1   True            71.6
2  False            68.0
3  False            78.8
4  False            28.4
0  False            75.2
1  False            95.0
2  False            96.8
3   True           102.2

## 5. Reading csv file and group by

Reference: https://www.youtube.com/watch?v=ENhGz1HkzvY <br>
https://www.youtube.com/watch?v=nulx_VmV7dE

<p style='text-align: right;'> 2*2=4 points</p>

Read the file 'weather_data.csv' and store it in a pandas dataframe 'df'

In [45]:
df=pd.read_csv('weather_data.csv')

print the shape and head of the dataframe

In [46]:
print(df.shape)
df.head()

(6, 4)

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain

Group the dataframe wrt to 'event' and save the resulting output in a variable named 'g'

<p style='text-align: right;'> 5*3 = 15 points</p>

In [47]:
g = df.groupby('event')

Print g and  type(g)

In [48]:
print(g)
print(type(g))

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000002520476E760>
<class 'pandas.core.groupby.generic.DataFrameGroupBy'>

Iterate over all the temperatures in g and print them

In [49]:
for i,j in g:
    print(i,j)

Rain         day  temperature  windspeed event
0  1/1/2017           32          6  Rain
4  1/5/2017           32          4  Rain
Snow         day  temperature  windspeed event
2  1/3/2017           28          2  Snow
3  1/4/2017           24          7  Snow
Sunny         day  temperature  windspeed  event
1  1/2/2017           35          7  Sunny
5  1/6/2017           31          2  Sunny

Use the describle method on g to get the complete description on it.

In [50]:
g.describe()

      temperature                                               windspeed  \
            count  mean       std   min   25%   50%   75%   max     count
event
Rain          2.0  32.0  0.000000  32.0  32.0  32.0  32.0  32.0       2.0
Snow          2.0  26.0  2.828427  24.0  25.0  26.0  27.0  28.0       2.0
Sunny         2.0  33.0  2.828427  31.0  32.0  33.0  34.0  35.0       2.0


      mean       std  min   25%  50%   75%  max
event
Rain   5.0  1.414214  4.0  4.50  5.0  5.50  6.0
Snow   4.5  3.535534  2.0  3.25  4.5  5.75  7.0
Sunny  4.5  3.535534  2.0  3.25  4.5  5.75  7.0

Create a new column in the dataframe df, named 'hot_temp' which contains True if temp is above 30, else False

<p style='text-align: right;'> 5 points</p>

In [51]:
#code here to filter df with above condition
def condition(temp):
    if(temp>30):
        return True
    else:
        return False
df['hot_temp'] = df['temperature'].apply(condition)

In [52]:
# print df
df

        day  temperature  windspeed  event  hot_temp
0  1/1/2017           32          6   Rain      True
1  1/2/2017           35          7  Sunny      True
2  1/3/2017           28          2   Snow     False
3  1/4/2017           24          7   Snow     False
4  1/5/2017           32          4   Rain      True
5  1/6/2017           31          2  Sunny      True

## Data Range

Reference:-https://www.youtube.com/watch?v=dRxCvSbMEto

<p style='text-align: right;'> 5*3 = 15 points</p>

Create a pandas daterange where starting date is 1st of January,2020 and end date is 1st of April 2021, store it in a new variable named 'a'

In [53]:
a = pd.date_range(start='2020-01-01', end='2021-04-01')

print a

In [56]:
a #(Output earlier shown was different from earlier printed as earlier it was considering last date as 1st January 2021 instead of 1st April 2021 )

DatetimeIndex(['2020-01-01', '2020-01-02', '2020-01-03', '2020-01-04',
               '2020-01-05', '2020-01-06', '2020-01-07', '2020-01-08',
               '2020-01-09', '2020-01-10',
               ...
               '2021-03-23', '2021-03-24', '2021-03-25', '2021-03-26',
               '2021-03-27', '2021-03-28', '2021-03-29', '2021-03-30',
               '2021-03-31', '2021-04-01'],
              dtype='datetime64[ns]', length=457, freq='D')

What is the len of a?

In [57]:
len(a)

457

What is the type of a?

In [58]:
print(type(a))

<class 'pandas.core.indexes.datetimes.DatetimeIndex'>

________________
# Hey high five! You solved the 4th milestone challenge too! Pawri to banti hai ;)
________________

# Its Feedback Time!

We hope you’ve enjoyed this course so far. We’re committed to help you use "AI for All" course to its full potential, so that you have a great learning experience. And that’s why we need your help in form of a feedback here.

**Please fill this feedback form**
 https://zfrmz.in/MtRG5oWXBdesm6rmSM7N